import 'package:bangladesh/Homepage.dart';
import 'package:flutter/material.dart';

class sirajganj extends StatelessWidget {
  const sirajganj({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.white,
      appBar: AppBar(
        title: Text("সিরাজগঞ্জ জেলা",style: TextStyle(fontWeight: FontWeight.bold,fontFamily: 'BalooDa2-Medium'),),
        backgroundColor: Color(0xFFA3E4D7),
        foregroundColor: Colors.black,
        elevation: 5,
        shape: RoundedRectangleBorder(
            borderRadius: BorderRadius.only(bottomRight: Radius.circular(30),bottomLeft: Radius.circular(30))
        ),
        actions: <Widget>[
          IconButton(onPressed: (){
            Navigator.push(context, MaterialPageRoute(builder: (context)=>homepage()));
          }, icon: Icon(Icons.water_damage_outlined,size: 25,))
        ],
      ),
      body: Padding(
        padding: const EdgeInsets.all(8.0),
        child: SingleChildScrollView(
          scrollDirection: Axis.vertical,
          child: Column(
              children: <Widget>[
                Container(
                  child: Center(child: Text("সিরাজগঞ্জ জেলার মানচিত্র",
                    style: TextStyle(fontSize: 25,color: Colors.indigo,fontWeight: FontWeight.bold,fontFamily: 'BalooDa2-Medium'),)),
                ),
                Container(
                  child: Image.asset("images/Sirajganj_map.jpg"),
                ),
                SizedBox(height: 15,),
                Container(
                  child: Center(child: Text("সিরাজগঞ্জ জেলা",
                    style: TextStyle(fontSize: 30,color: Colors.indigo,fontWeight: FontWeight.bold,fontFamily: 'BalooDa2-Medium'),)),
                ),
                SizedBox(height: 15,),
                Container(
                  child: Text("সপ্তম শতাব্দীর পর থেকেই ময়মনসিংহের দক্ষিণ-পশ্চিম অঞ্চল অর্থাৎ সিরাজগঞ্জ, জামালপুর, টাঙ্গাইল, গাজীপুর, ফরিদপুর বছরের প্রায় আট/নয় মাস পানির নিচে থাকতো। ফলে জনবসতি ছিল কম। এ অঞ্চল থেকে পানি সাগরের দিকে নেমে গেলে বছরের চার পাঁচ মাস সময়ে পাশ্ববর্তী কায়েম অঞ্চল থেকে লোকজন আবাদ বসত চালু রাখার জন্য ভীড় জমাতো। সেই শুকনো মৌসুমে কতিপয় মেহনতি মানুষ একতাবদ্ধ হয়ে পরবর্তী বছরে প্লাবনের হাত থেকে রেহাই পাওয়ার জন্য জাংগাল (বাঁধ) তৈরী করত। ফলে জাংগালের মধ্যকার জলাভূমি কিছুকালের মধ্যেই কায়েমী অঞ্চলের আকার ধারণ করত। ধারণা করা হয় সমূদ্রতট থেকে সমতট শব্দটির উৎপত্তি। চৈনিক পরিব্রাজক হিউয়েন সাং এর সঙ্গে প্রায়ই ঐক্যমতে ডাঃ কালিদাস নাগ, পিএইচডি তদানিন্তন বঙ্গের পূর্বের নিম্নাঞ্চলকে অর্থাৎ পূর্ব বঙ্গের প্রায় অংশকেই সমতট বলে আখ্যা দিয়েছেন। ময়মনসিংহের অধিকাংশ এলাকাই এই সমতটের অন্তর্গত সমতল ভূমি। শশাঙ্ক ৬১৯ খৃষ্টাব্দ পর্যন্ত বঙ্গদেশে রাজত্ব করেন, জ্ঞান সমগ্র আর্য্যবর্তে বাঙ্গালীদের সম্রাজ্য স্থাপনের স্বপ্ন দেখেন এবং আংশিক সে স্বপ্নকে সফল করেন (R.C. Mojuccedu Bangladesher Itihash-P-31)। পরবর্তী যুগে বাঙ্গালী বংশোদ্ভুত শেরশাহের পুত্র সলিম শাহ শের শাহের মৃত্যুর পর জালাল উদ্দিন খাঁ সলিম শাহ নাম ধারণ পূর্বক দিল্লীর মসনদে আরোহন করেন। তিনিই একমাত্র বাঙালী যিনি দিল্লির মসনদে শেরশাহের পুত্র রূপে আরোহণ করে আট বৎসর রাজত্ব করেন (১৫৪৫-১৫৫৩ খৃঃ)। তিনি পাবনা জেলার চাইমোহর থানার অন্তর্গত সমাজ নামক গ্রামে জন্মলাভ করেন ও প্রতিপালিত হন এবং পরে দিল্লী গমন করে পিতার সহিত মিলিত হন ও শাহী মসনদে আরোহন করেন। পাল রাজাগণের সময় এ অঞ্চলের শাসকদের লাট, চাট, ভাট ইত্যাদি পদ দেয়া হত। সম্ভবত এই ভাট হইতেই বঙ্গদেশের যমুনা নদীর ও রাজমহলের নিম্নেদেশ - পাবনা ও ফরিদপুর অঞ্চল ভাটের দেশ বলে পরিচিত। পাবনা জেলা ও তৎকালে সিরাজগঞ্জ মহকুমায় যে বিরাট চলনবিলের অস্তিত্ব বর্তমান তা দৃষ্টে ও পাবনা জেলার ইতিহাস (রাধা রমন সাহা-১-৩ খন্ড), অধ্যাপক আব্দুল হামিদ এর চলনবিলের ইতিকথা ও প্রমথবিশীর চলনবিল গ্রন্থে যে ঐতিহাসিক বর্ণনা বিভিন্ন ভাবে পাওয়া যায়, তৎসঙ্গে হজরত শাহ জালাল (রঃ) জীবনী গ্রন্থ (কৃত চৌধুরী গোলাম আকবর) এর খন্দকার আব্দুর রহিম সাহেবের টাঙ্গাইলের ইতিহাস এবং করটিয়া খান পন্নী সাহেবের নিজস্ব ইতিহাস পাঠে জানা যায় যে রাজমহল পাহাড় হতে টাঙ্গাইলের দক্ষিণে আটিয়া গ্রামের পশ্চিম পাশের লৌহজং নদী পর্যন্ত বিশাল জলধিতল ছিল (আটিয়া শাহী মসজিদ লৌহজং নদীর পূর্বতীরে প্রতিষ্ঠাকাল ১৬০৯)। সম্রাট আকবরের রাজত্ব কালে কাগমারীর দরবেশ হযরত শাহ জালাল (রঃ) এবং তার মামা শাহানশাহ হযরত বাবা আদম (রঃ) কাশ্মিরী এ অঞ্চলে আগমন ও ইসলাম প্রচার করেন। তাঁদের জীবনীতেই বিশাল জলধির মধ্যে চর জাতীয় প্রাচীন ভূমির উল্লেখ পাওয়া যায়। অনুরূপভাবে শাহজাদপুরে হযরত শাহদৌলা মখদুম (রঃ) সিরাজগঞ্জে হযরত শাহ সিরাজউদ্দিন, নওগাঁতে দাদাপীর, রাজশাহী জেলার বাঘাতে শাহাদৌলা জামী দানেশমন্দ (রঃ) এবং চর মধ্যাহ্ন দ্বীপে বারুহাস ইমামবাড়ী পীর সাহেবের আগমন ঘটে।মধ্য যুগ১১৯৩ খৃষ্টাব্দে কুতুব উদ্দিন আইবেক দিল্লী জয় করেন। কুতুব উদ্দিন তার অনুচর ইখতিয়ার উদ্দিন মুহাম্মদ বিন বখতিয়ার খিলজিকে বাংলা ও বিহার জয় করার জন্য প্রেরণ করেন। ইখতিয়ার উদ্দিন মুহাম্মদ বিন বখতিয়ার খিলজি ১২০৪ খৃষ্টাব্দে বাংলা জয় করেন ও এ অঞ্চল মুসলিম শাসকদের অধীনে আসে। এদেশে মুসলিম বিজয়ের ১৪০ বছর পর ইবনে বতুতার সফর নামা এবং ২০০ বছর পর মাহুয়ানের বিবরণ এই দুটো মিলিয়ে দেখলে আমরা খুব সহজেই এই সিদ্ধান্তে উপনীত হতে পারি যে, মুসলিম বিজয়ের ১৫০ বছরের মধ্যেই সিরাজগঞ্জের অধিবাসীদের জীবনে ইসলাম একটা অপ্রতিরোধ্য ফ্যাক্টর হয়ে ওঠে এবং ২০০ বছরের মধ্যে অর্থাৎ যখন চৈনিক দূত মাহুয়ান এদেশে সফর করেন, তখন সিরাজগঞ্জের জনসাধারণের অধিকাংশ ইসলাম ধর্মের অনুসারী ছিল। মাহুয়ানের সফরের সময় সিরাজগঞ্জ তথা ভাটি অঞ্চলের জনসাধারণ তখন কেবল মুসলমান হিসেবে সংখ্যাগরিষ্ঠ ছিল তাই নয়, বরং স্বাধীন গোষ্ঠি হিসেবে সারা বিশ্বে বিখ্যাত হয়ে উঠেছিল। এ অঞ্চলের জনসাধারণ তখন মিথ্যা ও ছলচাতুরীর আশ্রয় নিতে জানত না। এভাবেই তারা ১৫৩৮ সাল পর্যন্ত স্বাধীনভাবেই বসবাস করছিল। ১৫৩৮ সালে মোঘল বাদশা হুমায়ূন গৌড় দখল করেন (সেপ্টেম্বর ১৫৩৮ খৃষ্টাব্দ)। গৌড়ের সুরম্য প্রাসাদাবলী ও প্রাকৃতিক সৌন্দর্য দেখে বাদশা হুমায়ূন খুবই মুগ্ধ হন এবং তিনি এর নাম রাখেন জান্নাতাবাদ।মুঘল আমলমুঘল আমলে (১৫৩৮-১৭৪০ খৃষ্টাব্দ পর্যন্ত) সুবা বাংলাকে প্রশাসনিক সুবিধার্থে ১৯টি সরকারে এবং ৬৮২টি পরগণায় বিভক্ত করা হয়েছিল। সেই সরকার গুলির মধ্যে ‘সরকার বাজুহা’ আকার আয়তনে ছিল অনেক বড়। তৎকালে সরকার বাজুহাকে প্রশাসনিক সুবিধার্থে ৩২ টি মহলে বিভক্ত করে। সে সময় সরকার বাজুহা মোট রাজস্ব ছিল ৩৫,১৬,৮৭১ দাম যা টাকার হিসেবে ৯,৮৭,৯২১ টাকা (১ টাকা = ৪০ দাম)। সিরাজগঞ্জ জেলাটি সেই সরকার বাজুহার অন্তর্গত হলেও ৩২টি মহলের কোনটির মধ্যে অবস্থিত সেটা ধারণা করা কঠিন। ‘‘সরকার বাজুহার’’ মধ্যে আমাদের অতি পরিচিত মোমেনশাহী, ভাওয়াল বাজু ও ঢাকা বাজু উল্লেখ আছে। কিন্তু সিরাজগঞ্জ নামে আমরা কোন মহলের নাম দেখি না। সিরাজগঞ্জ যে সরকার বাজুহার মধ্যকার একটি এলাকা এ সম্বন্ধে সন্দেহের কোন অবকাশ নেই। ঢাকার কিছু এলাকা এবং ভাওয়ালগড় সহ বৃহত্তর মোমেনশাহী জেলার সমগ্র এলাকাই ছিল সরকার বাজুহার অন্তর্গত। ইতিহাস পর্যালোচনায় জানা যায়, ১৮৪৫ সনের পূর্ব পর্যন্ত সিরাজগঞ্জ ছিল মোমেনশাহী জেলার অন্তর্গত। ঈশা খানের আমলে সাগরের মতো যমুনা নদীর অথৈ পানি ছুটে চলতো এপার থেকে ওপার দশ বার মাইল জুড়ে। সিরাজগঞ্জ শহরটি যেখানে এখন অবস্থিত, সেখানটিতে জনমানুষের বসতি ছিল না সে আমলে। যমুনা নদীর মাঝি মাল্লারা সেখানে কখনো নৌকা ভিড়াতো না। সে এলাকাটি তখন লোকে বলতো ভুতের দিয়ার। এ নিয়ে রয়েছে বহু জনশ্রুতি। রাত্রি হলেই নাকি হাজারে হাজারে লাখে লাখে ভুত সেই দিয়ারে হাজির হত। যদি কোন নৌকা বিপাকে পড়ে সেই ভুতের দিয়ারের ধার কাছ দিয়ে রাত্রিকালে উজান ভাটি চলতো, তাহলে দেখা যেত নৌকার মাঝি মাল্লা চরনদারদের ঘাড় মটকিয়ে রেখেছে ভুতেরা। তবে এখনো সিরাজগঞ্জ আদি শহরটি যে মৌজাতে অবস্থিত, তার নাম বহাল তবিয়তে ভুতের দিয়ার রূপেই টিকে আছে। বর্তমান জেলা প্রশাসকের কার্যালয় সংলগ্ন এলাকা এবং সদর ভূমি অফিস, পৌরসভা কার্যালয় ভুতের দিয়ার মৌজায় অবস্থিত।বৃটিশ আমলবৃটিশ আমলের গোড়ার দিকে বাংলাদেশের ৬৮২টি পরগনাকে জেলা হিসাবে গণ্য করা হয়নি। প্রথমে মুসলিম আমলের প্রশাসনিক কাঠামোকে পরিবর্তন করা হয়েছে। তারপর বাংলাদেশের প্রশাসনিক তাগিদ পূরণের উদ্দেশ্যে সারা দেশের মধ্যে মাত্র ৪/৫জন জেলা কালেক্টর নিয়োগ করা হয়েছে। বৃটিশ আমলের প্রথম দিকে নোয়াখালী, রংপুর, ঢাকা, ও মোমেনশাহী এই চারটি জেলা কালেক্টরেটের সাহায্যে বাংলাদেশের মতো একটি বিশাল দেশ শাসন করা হতো। ১৭৮৬ থেকে ১৭৯৩ সাল পর্যন্ত লর্ড কর্ণওয়ালিসের আমলে সিরাজ আলী চৌধুরী নামে এক সম্ম্ভ্রান্ত জমিদার ছিলেন সোহাগপুরে। ১৭৮৭ সালে মোমেনশাহী জেলা স্থাপিত হয়। এই একই বছরে লর্ড কর্ণওয়ালিসের কাছ থেকে বড় বাজু পরগনার সাত আনা হিস্যা সিরাজ আলী চৌধুরী ‘সিরাজগঞ্জ জমিদারী’ নামে পত্তনী লাভ করেন। কিন্তু বৃটিশ আমলের প্রথম দিকে জমিদারের হাতে যেহেতু প্রশাসনিক ক্ষমতা ন্যস্ত করা হয়নি, সেহেতু সিরাজগঞ্জ ছিল মোমেনশাহী জেলার প্রশাসনিক আওতায়; তখন জামালপুর, কিশোরগঞ্জ প্রভৃতিও মোমেনশাহী জেলার আওতাধীন ছিল। ১৭৯০ সালে মোমেনশাহী জেলার কালেক্টর সাহেব বিশাল মোমেনশাহী জেলার স্থানে স্থানে থানা স্থাপনের তাগিদে ঢাকা রেভিনিউ বোর্ডের কাছে পরানগঞ্জ, কটিয়াদী, চাঁদগঞ্জ, সিরাজগঞ্জ, জগনাথগঞ্জ, শের মদন, শের দিবার দিয়া, শের মাচরা প্রভৃতি স্থানের প্রস্তাব পেশ করেন। ১৭৯২ সালের মধ্যে সিরাজগঞ্জসহ ঐসব এলাকায় প্রথম বিলেতি প্যাটার্নের থানা স্থাপিত হয়। ১৮৪৫ সালে মোমেনশাহী জেলায় ধরমচান্দ ঘোষ প্রথম ডেপুটি ম্যাজিস্ট্রেট নিযুক্ত হয়ে আসেন। ম্যাজিস্ট্রেট মোমেনশাহী জেলার পূর্ব ও পশ্চিম দিকে দুইটি মহকুমা স্থাপনের প্রস্তাব করেন। শেরপুর, সিরাজগঞ্জ, হাজীপুর ও পিংনাসহ ৪ থানা নিয়ে ১৮৪৫ সালে জামালপুর মহকুমা এবং নিকলী, বাজিতপুর, ফতেপুর ও মাদারগঞ্জ এই ৪ থানা নিয়ে হুসেনপুর বা নিকলী মহকুমা স্থাপনের প্রস্তাব করা হয়। ১৮৪৫ সালের এপ্রিল মাসে সরকার সিরাজগঞ্জ ও জামালপুর মহকুমা দুইটি স্থাপনের অনুমতি দেন। ফলে ১৮৪৫ সালে বিশাল মোমেনশাহী জেলার অধীনে জামালপুর ও সিরাজগঞ্জ নামে দুইটি মহকুমার সৃষ্টি করা হয়। প্রসঙ্গতঃ বলে রাখা যায়, পরবর্তীকালে মোমেনশাহী জেলাকে বিভক্ত করে ১৮৬৫ সালে কিশোরগঞ্জ, ১৮৬৯ সালে টাংগাইল এবং ১৮৮২ সনে নেত্রকোণা মহকুমা সৃষ্টি করা হয়েছিল। ইতিমধ্যে ১৮২৮ সালে রাজশাহীর একাংশ নিয়ে পাবনা জেলার পত্তন হয়েছিল। সিরাজগঞ্জবাসীর দীর্ঘদিনের দাবীর প্রেক্ষিতে ১৮৫৫ সালে যমুনা নদীর গতি পরিবর্তনের কারণে সিরাজগঞ্জ থানাকে পাবনা জেলার অন্তর্ভুক্ত করা হয় (পাবনা গেজেট পৃষ্ঠা নং ৪৩)। ১৮৭৫ সালে রায়গঞ্জ থানাকে সিরাজগঞ্জ মহকুমার অন্তর্ভুক্ত করে সিরাজগঞ্জের প্রশাসনিক বিস্তৃতি ঘটানো হয়েছিল। ১৯৮৪ সালে সিরাজগঞ্জ জেলা হিসেবে স্বীকৃতি পায়।",
                    textAlign: TextAlign.justify,
                    style: TextStyle(fontSize: 20,fontFamily: 'BalooDa2-Medium'),
                  ),
                ),
                SizedBox(height: 20,),
                Container(
                  child: Table(
                    border: TableBorder.all(color: Colors.teal,),
                    children: [
                      TableRow(
                          children: [
                            Text(" ভৌগলিক অবস্থান :",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text("অক্ষাংশ ২৪০ ০০’- ২৪০ ৪০’ দ্রাঘিমাংশ ৮৯০ ২০’- ৮৯০ ৫০’",textAlign: TextAlign.justify,
                                style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text(" জনসংখ্যাঃ",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ৩২,২০,৮১৪ জন",textAlign: TextAlign.justify,
                                style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text(" শিক্ষার হার:",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ৬৮%",textAlign: TextAlign.justify,
                                style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text(" আয়তনঃ",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ২৪৯৭.৯২ বর্গ কিলোমিটার",textAlign: TextAlign.justify,
                                style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  উপজেলার সংখ্যাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ০৯ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  পৌরসভার সংখ্যাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ০৬ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  ইউনিয়নের সংখ্যাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ৮৩ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  গ্রামের সংখ্যাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ২,১৮০ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  মৌজার সংখ্যাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ১৪৭২ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  মোট জমির পরিমাণঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ১,৯৫,৯৩৭ হেক্টর\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  দৈনিক পত্রিকাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" 07 টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  পুলিশ থানার সংখ্যাঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ১২ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  স্বাস্থ্য কেন্দ্র ও হাসপাতাল\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ১১৫ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  শিক্ষা প্রতিষ্টান\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" ২৩৭৪ টি\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                      TableRow(
                          children: [
                            Text("  বিখ্যাত খাবারঃ\n",style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'),),
                            Text(" পানিতোয়া\n",textAlign: TextAlign.justify,style: TextStyle(fontSize: 18,fontFamily: 'BalooDa2-Medium'))
                          ]
                      ),
                    ],
                  ),
                )
              ]
          ),
        ),
      ),
    );
  }
}
